# OASIS INFOBYTE INTERNSHIP
## ABEERA MALAKAR
### TASK 3
#### CAR PRICE PREDICTION USING MACHINE LEARNING

In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.read_csv('car.csv')

In [3]:
df.sample(15)

,name,company,year,Price,kms_driven,fuel_type
326,Maruti Suzuki Wagon R,Maruti,2016,"3,44,999","15,000 kms",Petrol
417,Mahindra XUV500 W8,Mahindra,2012,"5,60,000","1,00,000 kms",Diesel
569,Chevrolet Spark 1.0 LT,Chevrolet,2011,"1,00,000","27,000 kms",Petrol
28,Maruti Suzuki Alto LX,Maruti,2008,"95,000","70,000 kms",Petrol
879,Maruti Suzuki Alto LXi BS III,Maruti,2005,"95,000","65,000 kms",Petrol
642,Maruti Suzuki Swift,Maruti,2012,"2,80,000","48,006 kms",Diesel
221,Maruti Suzuki Alto 800,Maruti,2015,"2,19,000","5,000 kms",Petrol
566,Force Motors One SUV,Force,2013,"5,50,000","1,40,000 kms",Diesel
267,Maruti Suzuki SX4 ZXI MT,Maruti,2010,"2,49,999","36,000 kms",Petrol
771,Hyundai Santro,Hyundai,2002,"60,000","47,000 kms",Petrol
384,Honda City 1.5 S MT,Honda,2010,"2,25,000","70,000 kms",Petrol
404,Maruti Suzuki Omni Limited Edition,Maruti,2001,"70,000","70,000 kms",Petrol
356,Maruti Suzuki Swift,Maruti,2013,"3,24,999","45,000 kms",Diesel
469,Toyota Corolla H2,Toyota,2003,"1,50,000","1,00,000 kms",Petrol
98,Maruti Suzuki Swift Dzire VXi 1.2 BS IV,Maruti,2014,"3,90,000","35,000 kms",Petrol

In [4]:
df.head()

,name,company,year,Price,kms_driven,fuel_type
0,Hyundai Santro Xing XO eRLX Euro III,Hyundai,2007,"80,000","45,000 kms",Petrol
1,Mahindra Jeep CL550 MDI,Mahindra,2006,"4,25,000",40 kms,Diesel
2,Maruti Suzuki Alto 800 Vxi,Maruti,2018,Ask For Price,"22,000 kms",Petrol
3,Hyundai Grand i10 Magna 1.2 Kappa VTVT,Hyundai,2014,"3,25,000","28,000 kms",Petrol
4,Ford EcoSport Titanium 1.5L TDCi,Ford,2014,"5,75,000","36,000 kms",Diesel

In [5]:
df.tail()

,name,company,year,Price,kms_driven,fuel_type
887,Ta,Tara,zest,"3,10,000",NaN,NaN
888,Tata Zest XM Diesel,Tata,2018,"2,60,000","27,000 kms",Diesel
889,Mahindra Quanto C8,Mahindra,2013,"3,90,000","40,000 kms",Diesel
890,Honda Amaze 1.2 E i VTEC,Honda,2014,"1,80,000",Petrol,NaN
891,Chevrolet Sail 1.2 LT ABS,Chevrolet,2014,"1,60,000",Petrol,NaN

In [6]:
#preprocessing

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 892 entries, 0 to 891
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        892 non-null    object
 1   company     892 non-null    object
 2   year        892 non-null    object
 3   Price       892 non-null    object
 4   kms_driven  840 non-null    object
 5   fuel_type   837 non-null    object
dtypes: object(6)
memory usage: 41.9+ KB

In [7]:
df.isnull().sum()

name           0
company        0
year           0
Price          0
kms_driven    52
fuel_type     55
dtype: int64

In [9]:
#data cleaning

df=df[~df['fuel_type'].isnull()]

In [10]:
df=df[df['year'].str.isnumeric()]

In [11]:
df['year']=df['year'].astype(int)

In [13]:
df=df[df['Price']!="Ask For Price"]

In [15]:
df['Price']=df['Price'].str.replace(',','').astype(int)

C:\Users\Sleo\AppData\Local\Temp\ipykernel_13372\166596357.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Price']=df['Price'].str.replace(',','').astype(int)

In [18]:
df['kms_driven']=df['kms_driven'].str.split(' ').str.get(0).str.replace(',','')

In [19]:
df.head()

,name,company,year,Price,kms_driven,fuel_type
0,Hyundai Santro Xing XO eRLX Euro III,Hyundai,2007,80000,45000,Petrol
1,Mahindra Jeep CL550 MDI,Mahindra,2006,425000,40,Diesel
3,Hyundai Grand i10 Magna 1.2 Kappa VTVT,Hyundai,2014,325000,28000,Petrol
4,Ford EcoSport Titanium 1.5L TDCi,Ford,2014,575000,36000,Diesel
6,Ford Figo,Ford,2012,175000,41000,Diesel

In [20]:
df=df[df['kms_driven'].str.isnumeric()]
df['kms_driven']=df['kms_driven'].astype(int)

In [21]:
df['name']=df['name'].str.split(' ').str.slice(0,3).str.join(' ')

In [22]:
df.head()

                     name   company  year   Price  kms_driven fuel_type
0     Hyundai Santro Xing   Hyundai  2007   80000       45000    Petrol
1     Mahindra Jeep CL550  Mahindra  2006  425000          40    Diesel
3       Hyundai Grand i10   Hyundai  2014  325000       28000    Petrol
4  Ford EcoSport Titanium      Ford  2014  575000       36000    Diesel
6               Ford Figo      Ford  2012  175000       41000    Diesel

In [26]:
df.reset_index(drop=True)

                       name   company  year   Price  kms_driven fuel_type
0       Hyundai Santro Xing   Hyundai  2007   80000       45000    Petrol
1       Mahindra Jeep CL550  Mahindra  2006  425000          40    Diesel
2         Hyundai Grand i10   Hyundai  2014  325000       28000    Petrol
3    Ford EcoSport Titanium      Ford  2014  575000       36000    Diesel
4                 Ford Figo      Ford  2012  175000       41000    Diesel
..                      ...       ...   ...     ...         ...       ...
811      Maruti Suzuki Ritz    Maruti  2011  270000       50000    Petrol
812          Tata Indica V2      Tata  2009  110000       30000    Diesel
813    Toyota Corolla Altis    Toyota  2009  300000      132000    Petrol
814            Tata Zest XM      Tata  2018  260000       27000    Diesel
815      Mahindra Quanto C8  Mahindra  2013  390000       40000    Diesel

[816 rows x 6 columns]

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 816 entries, 0 to 889
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        816 non-null    object
 1   company     816 non-null    object
 2   year        816 non-null    int32
 3   Price       816 non-null    int32
 4   kms_driven  816 non-null    int32
 5   fuel_type   816 non-null    object
dtypes: int32(3), object(3)
memory usage: 35.1+ KB

In [27]:
#Statistical Analysis

df.describe()

              year         Price     kms_driven
count   816.000000  8.160000e+02     816.000000
mean   2012.444853  4.117176e+05   46275.531863
std       4.002992  4.751844e+05   34297.428044
min    1995.000000  3.000000e+04       0.000000
25%    2010.000000  1.750000e+05   27000.000000
50%    2013.000000  2.999990e+05   41000.000000
75%    2015.000000  4.912500e+05   56818.500000
max    2019.000000  8.500003e+06  400000.000000

In [30]:
#Outlier Removal

df=df[df['Price']<6e6].reset_index(drop=True)
df

                       name   company  year   Price  kms_driven fuel_type
0       Hyundai Santro Xing   Hyundai  2007   80000       45000    Petrol
1       Mahindra Jeep CL550  Mahindra  2006  425000          40    Diesel
2         Hyundai Grand i10   Hyundai  2014  325000       28000    Petrol
3    Ford EcoSport Titanium      Ford  2014  575000       36000    Diesel
4                 Ford Figo      Ford  2012  175000       41000    Diesel
..                      ...       ...   ...     ...         ...       ...
810      Maruti Suzuki Ritz    Maruti  2011  270000       50000    Petrol
811          Tata Indica V2      Tata  2009  110000       30000    Diesel
812    Toyota Corolla Altis    Toyota  2009  300000      132000    Petrol
813            Tata Zest XM      Tata  2018  260000       27000    Diesel
814      Mahindra Quanto C8  Mahindra  2013  390000       40000    Diesel

[815 rows x 6 columns]

In [32]:
x=df.drop(columns="Price")
y=df['Price']

In [33]:
x.head()

                     name   company  year  kms_driven fuel_type
0     Hyundai Santro Xing   Hyundai  2007       45000    Petrol
1     Mahindra Jeep CL550  Mahindra  2006          40    Diesel
2       Hyundai Grand i10   Hyundai  2014       28000    Petrol
3  Ford EcoSport Titanium      Ford  2014       36000    Diesel
4               Ford Figo      Ford  2012       41000    Diesel

In [34]:
y.head()

0     80000
1    425000
2    325000
3    575000
4    175000
Name: Price, dtype: int32

In [35]:
# seperating training and testing data

from sklearn.model_selection import train_test_split

In [36]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2)

In [37]:
x_train.head()

                    name   company  year  kms_driven fuel_type
710      Hyundai Eon Era   Hyundai  2014       28400    Petrol
615  Hyundai Elantra 1.8   Hyundai  2012       65000    Petrol
784    Hyundai Santro AE   Hyundai  2003       70000    Petrol
767      Mahindra KUV100  Mahindra  2016       26500    Petrol
562   Tata Indigo Marina      Tata  2004       70000    Diesel

In [38]:
y_train.head()

710    200000
615    500000
784     60000
767    380000
562    180000
Name: Price, dtype: int32

In [39]:
from sklearn.preprocessing import OneHotEncoder,StandardScaler
ohe=OneHotEncoder()
ohe.fit(x[['name','company','fuel_type']])

OneHotEncoder()

In [41]:
from sklearn.compose import make_column_transformer
column_trans= make_column_transformer((OneHotEncoder(categories=ohe.categories_),['name','company','fuel_type']),
                                     remainder='passthrough')

In [47]:
from lightgbm import LGBMRegressor
import math
from sklearn.pipeline import make_pipeline
from sklearn.metrics import mean_squared_error,r2_score

In [51]:
#lgbm regressor

lgbm=LGBMRegressor()
pipe=make_pipeline(column_trans,lgbm)
pipe.fit(x_train,y_train)
y_pred_lgbm=pipe.predict(x_test)
r2=r2_score(y_test,y_pred_lgbm)
r2

0.310484346249156

In [53]:
#let's run LGBMRegression for 50 times and store the highest scores

score=[]
for i in range(50):
    x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=i)
    lgbm=LGBMRegressor()
    pipe=make_pipeline(column_trans,lgbm)
    pipe.fit(x_train,y_train)
    y_pred_lgbm=pipe.predict(x_test)
    score.append(r2_score(y_test,y_pred_lgbm))

In [54]:
score[np.argmax(score)]

0.649935361550203

In [62]:
#saving according to the best item

x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=np.argmax(score))
lgbm=LGBMRegressor()
pipe=make_pipeline(column_trans,lgbm)
pipe.fit(x_train,y_train)
y_pred_lgbm=pipe.predict(x_test)
r2=r2_score(y_test,y_pred_lgbm)
r2

0.649935361550203

# Testing our model prediction

In [63]:
pipe.predict(pd.DataFrame([['Maruti Suzuki Swift','Maruti',2019,100,'Petrol']],
            columns=['name','company','year','kms_driven','fuel_type'])) 

# original ans is 500000

array([504894.78336327])

In [64]:
pipe.predict(pd.DataFrame([['Ford Figo','Ford',2014,175000,'Diesel']],
            columns=['name','company','year','kms_driven','fuel_type'])) # original ans is 600000

array([628875.79580328])

# Saving the Model

In [65]:
import pickle

In [66]:
pickle.dump(pipe,open('quikr.pkl','wb'))

## Thank You